Revit 2027 API
BuiltInFailures.WallFailures.InvalidTargetPosition Property
 Joining the highlighted wall to the highlighted element moves the wall's top below its bottom or its bottom above its top, or interferes with wall joins or holes in the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidTargetPosition { get; }
Public Shared ReadOnly Property InvalidTargetPosition As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidTargetPosition {
	FailureDefinitionId^ get ();
}
static member InvalidTargetPosition : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace